---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElevationFailures.ElevationDetach
source: html/4e6b06f6-8b16-fed3-b821-53cbc6c7b15f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElevationFailures.ElevationDetach Property

An Elevation arrow can't keep its Crop Region extents attached.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElevationDetach { get; }
```